socialNetwork/wrk2/reversed-run-with-istio/COMMAND_5/15
Running 1m test @ http://localhost:31111/wrk2-api/post/compose
  4 threads and 4 connections
  Thread calibration: mean lat.: 1666.883ms, rate sampling interval: 4198ms
  Thread calibration: mean lat.: 1727.008ms, rate sampling interval: 4390ms
  Thread calibration: mean lat.: 1757.937ms, rate sampling interval: 4521ms
  Thread calibration: mean lat.: 1668.304ms, rate sampling interval: 4288ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     2.77s   436.32ms   3.93s    68.85%
    Req/Sec    96.82      7.57   107.00     81.82%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.71s 
 75.000%    3.02s 
 90.000%    3.39s 
 99.000%    3.93s 
 99.900%    4.18s 
 99.990%    4.24s 
 99.999%    4.28s 
100.000%    4.28s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    1725.439     0.000000            1         1.00
    2260.991     0.100000         1952         1.11
    2396.159     0.200000         3890         1.25
    2502.655     0.300000         5864         1.43
    2603.007     0.400000         7810         1.67
    2707.455     0.500000         9727         2.00
    2764.799     0.550000        10695         2.22
    2822.143     0.600000        11679         2.50
    2881.535     0.650000        12633         2.86
    2951.167     0.700000        13621         3.33
    3022.847     0.750000        14581         4.00
    3063.807     0.775000        15071         4.44
    3110.911     0.800000        15549         5.00
    3172.351     0.825000        16049         5.71
    3235.839     0.850000        16520         6.67
    3305.471     0.875000        17008         8.00
    3342.335     0.887500        17251         8.89
    3391.487     0.900000        17498        10.00
    3450.879     0.912500        17740        11.43
    3508.223     0.925000        17982        13.33
    3567.615     0.937500        18223        16.00
    3598.335     0.943750        18341        17.78
    3633.151     0.950000        18469        20.00
    3665.919     0.956250        18591        22.86
    3696.639     0.962500        18711        26.67
    3725.311     0.968750        18828        32.00
    3745.791     0.971875        18896        35.56
    3766.271     0.975000        18951        40.00
    3792.895     0.978125        19010        45.71
    3827.711     0.981250        19074        53.33
    3858.431     0.984375        19131        64.00
    3878.911     0.985938        19164        71.11
    3899.391     0.987500        19194        80.00
    3919.871     0.989062        19222        91.43
    3942.399     0.990625        19254       106.67
    3971.071     0.992188        19284       128.00
    3989.503     0.992969        19298       142.22
    4005.887     0.993750        19313       160.00
    4022.271     0.994531        19329       182.86
    4038.655     0.995313        19346       213.33
    4055.039     0.996094        19359       256.00
    4065.279     0.996484        19366       284.44
    4083.711     0.996875        19374       320.00
    4098.047     0.997266        19381       365.71
    4112.383     0.997656        19389       426.67
    4132.863     0.998047        19398       512.00
    4139.007     0.998242        19401       568.89
    4149.247     0.998437        19404       640.00
    4159.487     0.998633        19408       731.43
    4173.823     0.998828        19412       853.33
    4184.063     0.999023        19416      1024.00
    4190.207     0.999121        19417      1137.78
    4194.303     0.999219        19419      1280.00
    4202.495     0.999316        19422      1462.86
    4206.591     0.999414        19423      1706.67
    4210.687     0.999512        19425      2048.00
    4214.783     0.999561        19426      2275.56
    4218.879     0.999609        19428      2560.00
    4218.879     0.999658        19428      2925.71
    4227.071     0.999707        19430      3413.33
    4227.071     0.999756        19430      4096.00
    4227.071     0.999780        19430      4551.11
    4235.263     0.999805        19431      5120.00
    4235.263     0.999829        19431      5851.43
    4243.455     0.999854        19432      6826.67
    4243.455     0.999878        19432      8192.00
    4243.455     0.999890        19432      9102.22
    4251.647     0.999902        19433     10240.00
    4251.647     0.999915        19433     11702.86
    4251.647     0.999927        19433     13653.33
    4251.647     0.999939        19433     16384.00
    4251.647     0.999945        19433     18204.44
    4276.223     0.999951        19434     20480.00
    4276.223     1.000000        19434          inf
#[Mean    =     2769.442, StdDeviation   =      436.321]
#[Max     =     4272.128, Total count    =        19434]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  23550 requests in 1.00m, 4.83MB read
Requests/sec:    392.46
Transfer/sec:     82.40KB